import NousLogo from "../../assets/Logo.png"; // Import the logo image

export const WhoAboutSection = () => {
    return (
        <main id="aboutVision">

            <div>
                {/* Title And Description */}
                <h2>Το Όραμά μας;</h2>
                <p>
                    Στο NousGym, έχουμε θέσει έναν στόχο: να γκρεμίσουμε όλα τα εμπόδια που περιορίζουν την πρόσβαση στις υπηρεσίες ψυχικής υγείας. Είτε πρόκειται για γεωγραφικούς, χρονικούς, είτε κοινωνικούς φραγμούς, είμαστε εδώ για να φέρουμε τη φροντίδα πιο κοντά σε όλους. Παράλληλα, αγωνιζόμαστε να καταρρίψουμε το στίγμα που περιβάλλει την ψυχική υγεία, προβάλλοντας τη σημασία της ως αναπόσπαστο κομμάτι μιας γεμάτης και ισορροπημένης ζωής.
                </p>
            </div>

            {/* Logo image */}
            <div>
                <img src={NousLogo} alt="NousGym Logo" width={493} height={497} />
            </div>
        </main>
    )
}
